AirTemcoupling/0/airRegion/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1 0 0);

boundaryField
{
    inLetAir
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }
    outLetAir
    {
        type            zeroGradient;
    }
    yFrontCyclic
    {
        type            cyclic;
    }
    yBackCyclic
    {
        type            cyclic;
    }
    groundWall
    {
        type            noSlip;
    }
    topWall
    {
        type            zeroGradient;
    }
    airRegion_to_panel
    {
        type            noSlip;
    }
}


// ************************************************************************* //
