AirTemcoupling/0/airRegion/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/airRegion";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.35e-5;

boundaryField
{
    inLetAir
    {
        type zeroGradient;
    }
    outLetAir
    {
        type zeroGradient;
    }
    yFrontCyclic
    {
        type            cyclic;
    }
    yBackCyclic
    {
        type            cyclic;
    }
    groundWall
    {
        type            kqRWallFunction;
        value           uniform 1.35e-5;
        inletValue      uniform 1.35e-5;
    }
    topWall
    {
        type zeroGradient;
    }
    airRegion_to_panel
    {
        type            kqRWallFunction;
        value           uniform 1.35e-5;
        inletValue      uniform 1.35e-5;
    }
}

// ************************************************************************* //