AirTemcoupling/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inLetAir
    {
        type            patch;
        nFaces          2500;
        startFace       367500;
    }
    outLetAir
    {
        type            patch;
        nFaces          2500;
        startFace       370000;
    }
    yFrontCyclic
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2500;
        startFace       372500;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  yBackCyclic;
    }
    yBackCyclic
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2500;
        startFace       375000;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  yFrontCyclic;
    }
    groundWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       377500;
    }
    topWall
    {
        type            patch;
        nFaces          2500;
        startFace       380000;
    }
)

// ************************************************************************* //
