AirTemcoupling/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-4;
        relTol          0.05;
    }

    "(U|sigma)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-4;
        relTol          0.1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|sigma)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor      off;
    nOuterCorrectors       2;
    nCorrectors            2;
    nNonOrthogonalCorrectors 2;
    pRefCell               0;
    pRefValue              0;
    turbOnFinalIterOnly    no;
}

relaxationFactors
{
    equations
    {
        ".*"   0.7;
    }
}


// ************************************************************************* //
